---
kind: method
id: M:Autodesk.Revit.DB.CompoundStructure.CanSplitAndMergeRegionsBeUsed
source: html/58111c1e-6a6a-a123-522f-6a781588a8a8.htm
---
# Autodesk.Revit.DB.CompoundStructure.CanSplitAndMergeRegionsBeUsed Method

Checks whether split and merge regions operations can be used for this compound structure.

## Syntax (C#)
```csharp
public bool CanSplitAndMergeRegionsBeUsed()
```

## Returns
True if split and merge regions operation can be used for this compound structure, false otherwise.